---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.DirectShapeFailures
source: html/1e605543-5c67-5f4e-92cf-a05c7c598119.htm
---
# BuiltInFailures.DirectShapeFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.